run/cases/pelletExtruder/static/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{  
    
    inlet
    {
        type                flowRateInletVelocity;
        massFlowRate        6.1e-06;// kg/s  aprox. 0.36 kg/h
        rho                 rho;
        value               uniform (0 0 0);   
    }
    
    outlet
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }
    
    barrelup
    {
	type            slip;
    }
      
    barreldown
    {
	type            noSlip;
    }
    
    screwup
    {
	type            slip;
    }
    
    screwdown
    {
	type            noSlip;
    }
    
}


// ************************************************************************* //
