run/cases/pelletExtruder/static/Allrun
#!/bin/bash
#
#-------------------------------------------------#
# Author: Anuar R. Giménez El Amrani
#-------------------------------------------------#

#------------------------------------------------------------------------------
cd ${0%/*} || exit 1
clear
#------------------------------------------------------------------------------

echo -e "\n
Start meshing
-------------------------------------------------------------------------------
"

#------------------------------------------------------------------------------
echo -e "   - Create background mesh"
fluentMeshToFoam cad/background.msh

#------------------------------------------------------------------------------
echo -e "   - Extract surface features"
surfaceFeatureExtract

#------------------------------------------------------------------------------
echo -e "   - Meshing with snappyHexMesh (~ 48min)"
snappyHexMesh -overwrite 

#------------------------------------------------------------------------------
echo -e "\n
-------------------------------------------------------------------------------
End Meshing\n
"

#------------------------------------------------------------------------------
echo -e "   - Copy 0.orig to 0"
cp -r 0.orig 0

#------------------------------------------------------------------------------
echo -e "   - Decompose the case"
decomposePar

#------------------------------------------------------------------------------
echo -e "   - Start simulation (approximately 20h)"
pyFoamPlotRunner.py mpirun -np 6 polymSimpleFoam -parallel

#------------------------------------------------------------------------------
echo -e "   - Simulation ended\n\n"

#------------------------------------------------------------------------------
